In [1]:
import pandas as pd
rewards_df = pd.read_csv('RewardsData.csv')

#select single column in dataframe
rewards_df['City']

0        Minneapolis
1        Los Angeles
2              Merida
3       Winston-Salem
4       Winston-Salem
            ...
7247              NaN
7248              NaN
7249              NaN
7250              NaN
7251              NaN
Name: City, Length: 7252, dtype: object

In [2]:
type(rewards_df['City']) #verify it is a series

pandas.core.series.Series

In [7]:
rewards_df['City'].index.values

array([   0,    1,    2, ..., 7249, 7250, 7251], shape=(7252,))

In [5]:
rewards_df.dtypes

User ID                 int64
Birthdate              object
City                   object
State                  object
Zip                    object
Available Points        int64
Total Points Earned     int64
Points Spent            int64
Joined On              object
Last Seen              object
Tags                   object
dtype: object

In [15]:
#change data type for available points column to float
rewards_df["Available Points"] = rewards_df["Available Points"].astype(float)
rewards_df.dtypes

User ID                  int64
Birthdate               object
City                    object
State                   object
Zip                     object
Available Points       float64
Total Points Earned      int64
Points Spent             int64
Joined On               object
Last Seen               object
Tags                    object
dtype: object

In [13]:
#selecting multiple columns
locations_df = rewards_df[['City', 'State', 'Zip']]
locations_df

               City     State    Zip
0      Minneapolis    Georgia  55401
1      Los Angeles   Colorado  90210
2            Merida        AL  97204
3     Winston-Salem        NC  27106
4     Winston-Salem        NC  27109
...             ...       ...    ...
7247            NaN       NaN    NaN
7248            NaN       NaN    NaN
7249            NaN       NaN    NaN
7250            NaN       NaN    NaN
7251            NaN       NaN    NaN

[7252 rows x 3 columns]

In [16]:
#selecting rows in dataframe using iloc
rewards_df.iloc[0]

User ID                               1
Birthdate                     1/31/1992
City                       Minneapolis
State                           Georgia
Zip                               55401
Available Points                  300.0
Total Points Earned                 300
Points Spent                          0
Joined On                 9/4/2020 0:15
Last Seen              12/16/2021 17:42
Tags                        ClassOf2025
Name: 0, dtype: object

In [18]:
#selecting multiple rows using a range of index (slicing)
rewards_df.iloc[1:3]

,User ID,Birthdate,City,State,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
1,2,NaN,Los Angeles,Colorado,90210,320.0,320,0,8/19/2020 11:15,4/13/2022 14:28,ClassOf2025|apple
2,3,1/11/1990,Merida,AL,97204,330.0,330,0,10/13/2020 16:20,4/21/2021 10:54,Freshman|Developer

In [19]:
#setting the Stote column as new dataframe index column (key)
rewards_df.set_index('State', inplace=True)
rewards_df.head(4)

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
Georgia,1,1/31/1992,Minneapolis,55401,300.0,300,0,9/4/2020 0:15,12/16/2021 17:42,ClassOf2025
Colorado,2,NaN,Los Angeles,90210,320.0,320,0,8/19/2020 11:15,4/13/2022 14:28,ClassOf2025|apple
AL,3,1/11/1990,Merida,97204,330.0,330,0,10/13/2020 16:20,4/21/2021 10:54,Freshman|Developer
NC,4,4/16/1990,Winston-Salem,27106,10790.0,14290,3500,8/18/2020 13:21,6/30/2022 22:22,GraduateStudent|admin|MBBvsDuke

In [21]:
# selecting a rows by index label
georgia_df = rewards_df.loc['Georgia']
georgia_df

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
Georgia,1,1/31/1992,Minneapolis,55401,300.0,300,0,9/4/2020 0:15,12/16/2021 17:42,ClassOf2025
Georgia,2778,7/4/2000,Rex,30273,16490.0,16790,300,3/3/2021 3:01,6/4/2022 8:44,ClassOf2022
Georgia,7215,1/17/2004,Rome,30165,420.0,420,0,6/22/2022 15:28,6/23/2022 13:24,Student|ClassOf2026

In [22]:
# verify there only 3 rows records
georgia_df.shape

(3, 10)

In [24]:
# filter records for total points earned greater than 25,000
top_earners_df = rewards_df[rewards_df['Total Points Earned'] > 25000]
top_earners_df

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent

In [25]:
# sort records by a single column in descend order
top_earners_df.sort_values(by=['Total Points Earned'], ascending=False)

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent

In [26]:
# sort records by a single column in ascend order
top_earners_df.sort_values(by=['Total Points Earned'], ascending=True)

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke

In [28]:
# sort records by multiple columns in descend order
top_earners_df.sort_values(by=['State', 'Total Points Earned'], ascending=False)

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent

In [29]:
# sort records by index
top_earners_df.sort_index()

,User ID,Birthdate,City,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen,Tags
State,,,,,,,,,,
Illinois,1243,5/14/2002,Waukegan,60085,52165.0,52165,0,9/26/2020 1:22,6/30/2022 11:38,ClassOf2024|MBBvsDuke
Massachusetts,3055,6/10/2002,Bourne,2532,10890.0,28890,18000,8/18/2021 10:05,6/24/2022 14:25,ClassOf2025|MBBvsDuke
North Carolina,1611,NaN,Winston-Salem,27109,23765.0,50165,26400,9/29/2020 21:53,6/23/2022 13:54,ClassOf2024|MBBvsDuke
NaN,107,9/2/1998,NaN,NaN,1725.0,59525,57800,9/7/2020 15:16,6/29/2022 23:53,ClassOf2025|MBBvsDuke
NaN,644,NaN,NaN,NaN,21115.0,28515,7400,9/10/2020 12:37,5/18/2022 13:11,ClassOf2024
NaN,1492,8/15/1998,NaN,NaN,12600.0,33300,20700,9/28/2020 22:16,6/15/2022 23:37,ClassOf2022|MBBvsDuke|GraduateStudent
NaN,4654,12/3/1994,NaN,NaN,2045.0,26045,24000,9/2/2021 17:43,6/30/2022 17:02,GraduateStudent
NaN,4681,1/20/1995,NaN,NaN,18190.0,26690,8500,9/2/2021 18:54,6/24/2022 14:26,GraduateStudent